{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.13.0", "signature": {"inputs": {"input_13": {"name": "input_13:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "51"}]}}}, "outputs": {"dense_14": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "81"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_4/layer_normalization_7/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "17"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "17"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_35/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/dense_12/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_13/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "81"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "81"}]}}}}}, {"name": "input_13", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "51"}]}}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Shape", "op": "Shape", "input": ["input_13"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/reshape_54/Shape", "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack", "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_1", "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model_4/reshape_54/strided_slice", "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/1", "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/2"], "attr": {"axis": {"i": "0"}, "N": {"i": "3"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape", "op": "Reshape", "input": ["input_13", "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_4/reshape_54/Reshape", "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack", "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_1", "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice", "StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice", "StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/moments/SquaredDifference", "StatefulPartitionedCall/model_4/layer_normalization_7/moments/variance/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/moments/variance", "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/Rsqrt", "StatefulPartitionedCall/model_4/layer_normalization_7/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean", "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice", "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/sub", "op": "Sub", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/Reshape_1", "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/mul_1", "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/flatten_35/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add_1", "StatefulPartitionedCall/model_4/flatten_35/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_12/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/flatten_35/Reshape", "StatefulPartitionedCall/model_4/dense_12/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/dense_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_4/dense_13/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/dense_12/Relu", "StatefulPartitionedCall/model_4/dense_13/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/dense_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model_4/dense_13/Relu", "StatefulPartitionedCall/model_4/dense_14/MatMul/ReadVariableOp", "StatefulPartitionedCall/model_4/dense_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/model_4/dense_14/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_4/dense_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_4/dense_14/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_4/layer_normalization_7/Reshape_1", "shape": [1, 17, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/reshape_54/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/reshape_54/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/tf.__operators__.getitem_8/strided_slice/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/mean/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/moments/variance/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/batchnorm/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/layer_normalization_7/Reshape", "shape": [1, 17, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/flatten_35/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_4/dense_12/MatMul/ReadVariableOp", "shape": [34, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_12/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_13/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_13/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_14/MatMul/ReadVariableOp", "shape": [64, 81], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_4/dense_14/BiasAdd/ReadVariableOp", "shape": [81], "dtype": "float32"}]}]}